cases/case_0p8_ke/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    bottomWall
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          139;
        startFace       21744;
    }
    defaultFaces
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          21962;
        startFace       21883;
    }
    topWall
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          139;
        startFace       43845;
    }
    outlet
    {
        type            cyclic;
        inGroups        List<word> 1(cyclic);
        nFaces          79;
        startFace       43984;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  inlet;
    }
    inlet
    {
        type            cyclic;
        inGroups        List<word> 1(cyclic);
        nFaces          79;
        startFace       44063;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  outlet;
    }
)

// ************************************************************************* //
